MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFK144/mcu.h
extern volatile __ADCDATA11bits_t ADCDATA11bits __asm__ ("ADCDATA11") __attribute__((section("sfrs"), address(0xBF84B22C)));
#define ADCDATA12 ADCDATA12
extern volatile uint32_t   ADCDATA12 __attribute__((section("sfrs"), address(0xBF84B230)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA12bits_t;
extern volatile __ADCDATA12bits_t ADCDATA12bits __asm__ ("ADCDATA12") __attribute__((section("sfrs"), address(0xBF84B230)));
#define ADCDATA13 ADCDATA13
extern volatile uint32_t   ADCDATA13 __attribute__((section("sfrs"), address(0xBF84B234)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA13bits_t;
extern volatile __ADCDATA13bits_t ADCDATA13bits __asm__ ("ADCDATA13") __attribute__((section("sfrs"), address(0xBF84B234)));
#define ADCDATA14 ADCDATA14
extern volatile uint32_t   ADCDATA14 __attribute__((section("sfrs"), address(0xBF84B238)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA14bits_t;
extern volatile __ADCDATA14bits_t ADCDATA14bits __asm__ ("ADCDATA14") __attribute__((section("sfrs"), address(0xBF84B238)));
#define ADCDATA15 ADCDATA15
extern volatile uint32_t   ADCDATA15 __attribute__((section("sfrs"), address(0xBF84B23C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA15bits_t;
extern volatile __ADCDATA15bits_t ADCDATA15bits __asm__ ("ADCDATA15") __attribute__((section("sfrs"), address(0xBF84B23C)));
#define ADCDATA16 ADCDATA16
extern volatile uint32_t   ADCDATA16 __attribute__((section("sfrs"), address(0xBF84B240)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA16bits_t;
extern volatile __ADCDATA16bits_t ADCDATA16bits __asm__ ("ADCDATA16") __attribute__((section("sfrs"), address(0xBF84B240)));
#define ADCDATA17 ADCDATA17
extern volatile uint32_t   ADCDATA17 __attribute__((section("sfrs"), address(0xBF84B244)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits __asm__ ("ADCDATA17") __attribute__((section("sfrs"), address(0xBF84B244)));
#define ADCDATA18 ADCDATA18
extern volatile uint32_t   ADCDATA18 __attribute__((section("sfrs"), address(0xBF84B248)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits __asm__ ("ADCDATA18") __attribute__((section("sfrs"), address(0xBF84B248)));
#define ADCDATA19 ADCDATA19
extern volatile uint32_t   ADCDATA19 __attribute__((section("sfrs"), address(0xBF84B24C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA19bits_t;
extern volatile __ADCDATA19bits_t ADCDATA19bits __asm__ ("ADCDATA19") __attribute__((section("sfrs"), address(0xBF84B24C)));
#define ADCDATA20 ADCDATA20
extern volatile uint32_t   ADCDATA20 __attribute__((section("sfrs"), address(0xBF84B250)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA20bits_t;
extern volatile __ADCDATA20bits_t ADCDATA20bits __asm__ ("ADCDATA20") __attribute__((section("sfrs"), address(0xBF84B250)));
#define ADCDATA21 ADCDATA21
extern volatile uint32_t   ADCDATA21 __attribute__((section("sfrs"), address(0xBF84B254)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA21bits_t;
extern volatile __ADCDATA21bits_t ADCDATA21bits __asm__ ("ADCDATA21") __attribute__((section("sfrs"), address(0xBF84B254)));
#define ADCDATA22 ADCDATA22
extern volatile uint32_t   ADCDATA22 __attribute__((section("sfrs"), address(0xBF84B258)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA22bits_t;
extern volatile __ADCDATA22bits_t ADCDATA22bits __asm__ ("ADCDATA22") __attribute__((section("sfrs"), address(0xBF84B258)));
#define ADCDATA23 ADCDATA23
extern volatile uint32_t   ADCDATA23 __attribute__((section("sfrs"), address(0xBF84B25C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA23bits_t;
extern volatile __ADCDATA23bits_t ADCDATA23bits __asm__ ("ADCDATA23") __attribute__((section("sfrs"), address(0xBF84B25C)));
#define ADCDATA24 ADCDATA24
extern volatile uint32_t   ADCDATA24 __attribute__((section("sfrs"), address(0xBF84B260)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA24bits_t;
extern volatile __ADCDATA24bits_t ADCDATA24bits __asm__ ("ADCDATA24") __attribute__((section("sfrs"), address(0xBF84B260)));
#define ADCDATA25 ADCDATA25
extern volatile uint32_t   ADCDATA25 __attribute__((section("sfrs"), address(0xBF84B264)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA25bits_t;
extern volatile __ADCDATA25bits_t ADCDATA25bits __asm__ ("ADCDATA25") __attribute__((section("sfrs"), address(0xBF84B264)));
#define ADCDATA26 ADCDATA26
extern volatile uint32_t   ADCDATA26 __attribute__((section("sfrs"), address(0xBF84B268)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA26bits_t;
extern volatile __ADCDATA26bits_t ADCDATA26bits __asm__ ("ADCDATA26") __attribute__((section("sfrs"), address(0xBF84B268)));
#define ADCDATA27 ADCDATA27
extern volatile uint32_t   ADCDATA27 __attribute__((section("sfrs"), address(0xBF84B26C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA27bits_t;
extern volatile __ADCDATA27bits_t ADCDATA27bits __asm__ ("ADCDATA27") __attribute__((section("sfrs"), address(0xBF84B26C)));
#define ADCDATA28 ADCDATA28
extern volatile uint32_t   ADCDATA28 __attribute__((section("sfrs"), address(0xBF84B270)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA28bits_t;
extern volatile __ADCDATA28bits_t ADCDATA28bits __asm__ ("ADCDATA28") __attribute__((section("sfrs"), address(0xBF84B270)));
#define ADCDATA29 ADCDATA29
extern volatile uint32_t   ADCDATA29 __attribute__((section("sfrs"), address(0xBF84B274)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA29bits_t;
extern volatile __ADCDATA29bits_t ADCDATA29bits __asm__ ("ADCDATA29") __attribute__((section("sfrs"), address(0xBF84B274)));
#define ADCDATA30 ADCDATA30
extern volatile uint32_t   ADCDATA30 __attribute__((section("sfrs"), address(0xBF84B278)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA30bits_t;
extern volatile __ADCDATA30bits_t ADCDATA30bits __asm__ ("ADCDATA30") __attribute__((section("sfrs"), address(0xBF84B278)));
#define ADCDATA31 ADCDATA31
extern volatile uint32_t   ADCDATA31 __attribute__((section("sfrs"), address(0xBF84B27C)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA31bits_t;
